const tid = '24264995336433185';

module.exports = {
  cron: {
    name: 'ad3iya',
    description: 'يرسل أدعية عشوائية',
    zones: ['Africa/Algiers'],
    author: 'Allou Mohamed',
    call: ['12:00', '13:00', '14:00', '15:00', '16:00', '17:00', '18:00', '19:00', '20:00', '21:00', '22:00', '23:00', '23:59', '00:00', '01:00', '02:00', '03:00', '04:00', '05:00', '06:00', '06:30', '07:30', '08:30', '09:00', '10:00', '11:00']
  },
  call: async ({ api }) => {
   const adhkar = [
  "دعاء آدم عليه السلام: (ربنا إنا ظلمنا أنفسنا وإن لم تغفر لنا وترحمنا لنكونن من الظالمين)",
  "دعاء أيوب عليه السلام: (رب إني مسني الضر وأنت أرحم الراحمين)",
  "دعاء نوح عليه السلام: (رب اغفر لي ولوالدي ولمن دخل بيتي مؤمنا وللمؤمنين والمؤمنات)",
  "دعاء إبراهيم عليه السلام: (رب اجعلني مقيم الصلاة ومن ذريتي ربنا وتقبل الدعاء)",
  "دعاء لوط عليه السلام: (ربي نجني وأهلي مما يعملون)",
  "دعاء يونس عليه السلام: (لا إله إلا أنت سبحانك إني كنت من الظالمين)",
  "دعاء موسى عليه السلام: (رب اشرح لي صدري ويسر لي أمري واحلل عقدة من لساني يفقه قولي)",
  "دعاء شعيب عليه السلام: (رب افتح بيننا وبين قومنا بالحق وأنت خير الفاتحين)",
  "دعاء يوسف عليه السلام: (أنت ولي في الدنيا والآخرة توفني مسلما والحقني بالصالحين)",
  "دعاء محمد صلى الله عليه وسلم: (ربنا اتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار)",
  "اللهم صل على جميع الأنبياء والمرسلين",
  "واللهم صل وسلم وبارك على خاتم الأنبياء والمرسلين محمد صلى الله عليه وسلم.",
  "واللهم اجعل لنا نصيب من دعاء الأنبياء والمرسلين والحقنا بالصالحين.",
  "اللهم إني أسألك حسن الختمة",
  "اللهم ارزقني توبة نصوحه قبل الموت",
  "اللهم يا مقلب القلوب ثبت قلبي على دينك",
  "رب اغفر لي ولوالدي وللمؤمنين والمؤمنات الأحياء منهم والأموات يوم يقوم الحساب",
  "اللهم إني أسألك القبول والثبات واستجابة الدعاء",
  "لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير",
  "اللهم إنك عفو كريم تحب العفو فاعف عنا",
  "اللهم اعني على ذكرك وشكرك وحسن عبادتك",
  "اللهم يا مقلب القلوب ثبت قلبي على دينك",
  "اللهم اكبر اللهم اكبر لا إله إلا الله اللهم اكبر اللهم اكبر ولك الحمد",
  "اللهم آتنا في الدنيا حسنة والآخرة حسنة وقنا عذاب النار",
  "اللهم اني اسالك الهدى و التقى و العفاف والغنى",
  "اللهم مصرف القلوب صرف قلوبنا على طاعتك",
  "اللهم اغفر لي ذنبي كله دقه وجله وأوله وآخره وعلانيته وسره",
  "فاطر السماوات والأرض أنت ولي في الدنيا والآخرة توفني مسلما وألحقني بالصالحين",
  "رب أوزعني أن أشكر نعمتك التي أنعمت علي وعلى والدي وأن أعمل صالحا ترضاه إني تبت إليك وإني من المسلمين",
  "ربنا لا تزغ قلوبنا بعد إذ هديتنا وهب لنا من لدنك رحمة إنك أنت الوهاب",
  "ربنا اغفر لنا ذنوبنا واسرفنا في أمرنا وثبت أقدامنا وانصرنا على القوم الكافرين",
  "اللهم اهدني لأحسن الأخلاق لا يهدي لأحسنها إلا أنت، واصرف عني سيئها لا يصرف عني سيئها إلا أنت، لبيك وسعديك والخير كله في يديك، والشر ليس إليك، أنا بك وإليك، تباركت وتعاليت، أستغفرك وأتوب إليك",
  "اللهم اني اعوذ بك من قلب لا يخشع ومن دعاء لا يسمع و من نفس لا تشبع ومن علم لا ينفع اللهم اني اعوذ بك من هؤلاء الأربع",
  "اللهم إني أسألك من الخير كله عاجله، وآجله ما علمت منه وما لم أعلم، وأعوذ بك من الشر كله عاجله، وآجله ما علمت منه وما لم أعلم، اللهم إني أسألك من الخير ما سألك عبدك، ونبيك، وأعوذ بك من الشر ما عاذ به عبدك، ونبيك، وأسألك الجنة وما قرب إليها من قول وعمل، وأعوذ بك من النار وما قرب إليها من قول وعمل، وأسألك أن تجعل كل قضاء قضيته لي خيرا",
  "اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك..."
];
    function getRandomDua() {
  const randomIndex = Math.floor(Math.random() * adhkar.length);
  return adhkar[randomIndex];
}
    
const randomDua = getRandomDua();

    api.sendMessage(randomDua, tid);
    
  }
};
